src/cf/InformationRegisters/CRM_ВесаПозицийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВесаПозицийНоменклатуры</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ВесаПозицийНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция ПолучитьВесПозиции(Номенклатура, Знач Дата = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда Возврат 0; КонецЕсли;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ВесПозиции КАК ВесПозиции
	|ИЗ
	|	РегистрСведений.CRM_ВесаПозицийНоменклатуры.Срезпоследних(&Дата, Номенклатура = &Номенклатура)
	|");
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВесПозиции;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Процедура УстановитьВесПозиции(Номенклатура, ВесПозиции, Знач Дата = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда Возврат; КонецЕсли;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.CRM_ВесаПозицийНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.ВесПозиции = ВесПозиции;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецЕсли
